name: "24_rect_detectoin"

###########################################################################
###################            Scale 2             ########################
###########################################################################

layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { 
    shape: { 
      dim: 1 
      dim: 3 
      dim: 24 
      dim: 24 
    } 
  }
}
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "data"
  top: "conv1_2"
  convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 5
    stride: 2
  }
}
layer {
  name: "relu1_2"
  type: "ReLU"
  bottom: "conv1_2"
  top: "conv1_2"
}
layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "conv1_2"
  top: "conv2_2"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 5
    stride: 2
  }
}
layer {
  name: "relu2_2"
  type: "ReLU"
  bottom: "conv2_2"
  top: "conv2_2"
}
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "conv2_2"
  top: "conv3_2"
  convolution_param {
    num_output: 64
    kernel_size: 3
    pad: 0
    stride: 1
  }
}
layer {
  name: "relu3_2"
  type: "ReLU"
  bottom: "conv3_2"
  top: "conv3_2"
}
layer {
  name: "conv4_2"
  type: "Convolution"
  bottom: "conv3_2"
  top: "conv4_2"
  convolution_param {
    num_output: 1
    kernel_size: 1
    stride: 1
    pad: 0
  }
}
layer {
  name: "pred"
  type: "Sigmoid"
  bottom: "conv4_2"
  top: "pred"
}
