name: "48_rect_detectoin"

###########################################################################
###################            Scale 3             ########################
###########################################################################

layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { 
    shape: { 
      dim: 1 
      dim: 3 
      dim: 48 
      dim: 48
    } 
  }
}
layer {
  name: "conv1_3"
  type: "Convolution"
  bottom: "data"
  top: "conv1_3"
  convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 5
    stride: 2
  }
}
layer {
  name: "relu1_3"
  type: "ReLU"
  bottom: "conv1_3"
  top: "conv1_3"
}
layer {
  name: "conv2_3"
  type: "Convolution"
  bottom: "conv1_3"
  top: "conv2_3"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 5
    stride: 2
  }
}
layer {
  name: "relu2_3"
  type: "ReLU"
  bottom: "conv2_3"
  top: "conv2_3"
}
layer {
  name: "conv3_3"
  type: "Convolution"
  bottom: "conv2_3"
  top: "conv3_3"
  convolution_param {
    num_output: 32
    kernel_size: 3
    pad: 0
    stride: 1
  }
}
layer {
  name: "relu3_3"
  type: "ReLU"
  bottom: "conv3_3"
  top: "conv3_3"
}
layer {
  name: "conv4_3"
  type: "Convolution"
  bottom: "conv3_3"
  top: "conv4_3"
  convolution_param {
    num_output: 64
    kernel_size: 3
    pad: 0
    stride: 2
  }
}
layer {
  name: "relu4_3"
  type: "ReLU"
  bottom: "conv4_3"
  top: "conv4_3"
}
layer {
  name: "conv5_3"
  type: "Convolution"
  bottom: "conv4_3"
  top: "conv5_3"
  convolution_param {
    num_output: 64
    kernel_size: 3
    pad: 0
    stride: 1
  }
}
layer {
  name: "relu5_3"
  type: "ReLU"
  bottom: "conv5_3"
  top: "conv5_3"
}
layer {
  name: "conv6_3"
  type: "Convolution"
  bottom: "conv5_3"
  top: "conv6_3"
  convolution_param {
    num_output: 1
    kernel_size: 1
    stride: 1
    pad: 0
  }
}
layer {
  name: "pred_3"
  type: "Sigmoid"
  bottom: "conv6_3"
  top: "pred_3"
}

#layer {
#  name: "pred_coord"
#  type: "Convolution"
#  bottom: "conv5_3"
#  top: "pred_coord"
#  convolution_param {
#    num_output: 4
#    kernel_size: 1
#    stride: 1
#    pad: 0
#  }
#}

